<?php

# روت های مورد نیاز کاربر معمولی
# # # /my-factors لیست فاکتورهای خرید من
# # # /my-reserves لیست دوره های من
# # # /my-reserves-with-factors لیست دوره های من به همراه جزئیات فاکتور

# روت های مورد نیاز کاربر مسئول وقت سالن ورزشی
# # # /my-gym لیست سالن های من
# # # /my-reserve-template لیست نمونه وقت سالن های تعریف شده توسط من
# # # /my-reserve-template-form-gym لیست نمونه وقت سالن های تعریف شده توسط من برای فلان سالن

# روت های مورد نیاز کاربر ادمین
# روت های مورد نیاز کاربر سوپر ادمین
